app/controllers/group_leaders_controller.rb

SELECT "group_leaders".* FROM "group_leaders"
---
  def index
    @group_leaders = GroupLeader.all