app/controllers/meeting_points_controller.rb

  def index
    @meeting_points = MeetingPoint.all
---
SELECT "meeting_points".* FROM "meeting_points"