app/models/group_member.rb

 scope :get_eligible_group_leaders, -> do
    GroupMember.where('count(group_leader) group by group_leader_id ') # TODO
 end

 after_initialize do |new_record|
    if new_record.id.nil?
	    group = Group.get_recent_week_group
	    new_record.group_id = group.id if group.present?
---
SELECT "groups".* FROM "groups" WHERE (name between '2020-01-08' and '2020-01-14' )